import React from 'react';
import { makeStyles } from '@material-ui/core/styles';
import Accordion from '@material-ui/core/Accordion';
import AccordionSummary from '@material-ui/core/AccordionSummary';
import AccordionDetails from '@material-ui/core/AccordionDetails';
import Typography from '@material-ui/core/Typography';
import ExpandMoreIcon from '@material-ui/icons/ExpandMore';

const useStyles = makeStyles((theme) => ({
    root: {
        width: '1200px',
        margin: "100px auto",
        [theme.breakpoints.down(1200)]: {
            width: "85%"
        }
    },
    heading: {
        fontSize: theme.typography.pxToRem(15),
        fontWeight: theme.typography.fontWeightRegular,
    },
    answare : {
        color  : "darkgreen"
    }
}));

export default function SimpleAccordion() {
    const classes = useStyles();

    return (
        <div className={classes.root}>
            {
                data.map((item, ind) => (
                    <Accordion key={ind} color="primary">
                        <AccordionSummary
                            expandIcon={<ExpandMoreIcon />}
                            aria-controls="panel1a-content"
                            id="panel1a-header"
                        >
                            <Typography className={classes.heading}>{item.question}</Typography>
                        </AccordionSummary>
                        <AccordionDetails>
                            <Typography className={classes.answare}>
                                {item.answare}
                            </Typography>
                        </AccordionDetails>
                    </Accordion>
                ))
            }
        </div>
    );
}


let data = [
    { question: "شرایط شرکت در مسابقات چیست؟", answare: "محدودیت خاصی برای شرکت کنندگان در مسابقات هوش مصنوعی امیرکبیر وجود ندارد." },
    { question: "مراحل شرکت در مسابقات چیست؟", answare: "ثبت نام و شرکت در مسابقات در سه مرحله صورت می‌پذیرد. در مرحله اول، بعد از اعلام زمان پیش ثبت نام، مسئولین هر یک از تیم ها می بایست با مراجعه به سایت مسابقات پیش ثبت نام نمایند. در مرحله دوم، هر یک از تیم ها می بایست با ارسال گزارش فنی، ثبت نام خود را قطعی نمایند. در آخرین مرحله، هر یک از تیم‌ها با حضور در محل مسابقه در زمان برگزاری مسابقات برنامه خود را اجرا می کند که نتایج آن توسط اعضاء کمیته های فنی و اجرایی ثبت و به کمیته داوران اطلاع داده می شود. تیم های هر رشته مسابقه می بایست ارائه حضوری نیز از کار خود داشته باشند." },
    { question: "آیا امکان شرکت چند تیم از یک دانشگاه وجود دارد؟", answare: "در هر یک از رشته مسابقات، امکان شرکت چند تیم از یک دانشگاه وجود دارد. البته استفاده از عنوان دانشگاه مستلزم داشتن معرفی نامه از دانشگاه مربوطه است." },
    { question: "آیا امکان شرکت در مسابقه برای شرکت‌ها و محصولات تجاری نیز وجود دارد", answare: "بله. شرکت های توسعه دهنده محصولات تجاری در صورت تمایل می توانند در هر یک از رشته مسابقات شرکت کنند. بر خلاف تیم های عادی شرکت کننده در مسابقه، شرکت های تجاری می توانند کد برنامه های خود را ارائه نکنند که البته در این صورت تنها می توانند حائز رتبه شوند و از جوایز نقدی و سایر تسهیلات بهره مند نخواهند بود." },
    { question: "آیا نمونه داده های آموزشی و آزمایشی قبل از برگزاری مسابقه در اختیار تیم ها قرار داده می شود؟", answare: "در این زمینه هر یک از مسابقات سیاست های خاص خود را دارند که با مراجعه به صفحه مربوط به همان مسابقه می توانید از این امر مطلع شوید. در برخی از رشته مسابقات، نمونه داده های آموزشی در اختیار شرکت کنندگان قرار داده می شود در حالیه در برخی رشته های دیگر، تنها نمونه‌هایی از داده‌های آزمایشی در اختیار تیم‌ها قرار خواهد گرفت." },
    { question: "آیا تحویل کد برنامه در زمان برگزاری مسابقه الزامی است؟", answare: "بله. به منظور بررسی علمی کارهای ارائه شده و بررسی صحت ادعاهای تیم های شرکت کننده، هر یک از تیم‌ها ملزم هستند کد برنامه خود را نیز به مسئولین برگزاری مسابقه تحویل دهند. کلیه حقوق معنوی مربوط به ایده‌ها و روش‌های پیاده‌سازی شده متعلق به تیم‌های شرکت کننده است و برگزارکنندگان مسابقات تمام تلاش خود را برای حفاظت از اطلاعات کاربران به کار می‌گیرند." },
    { question: "آیا گواهی شرکت و مقام به تیم ها داده می شود؟", answare: "به کلیه تیم هایی که در زمان برگزاری مسابقات در محل برگزاری حضور یابند و برنامه‌های آنها حداقل امتیاز ممکن را کسب نماید گواهی شرکت در مسابقات داده می‌شود. همچنین، گواهی رتبه تنها برای تیم های حائز رتبه‌ای که حداقل امتیازات در نظر گرفته شده را کسب نمایند صادر می‌شود. بر اساس تشخیص کمیته داوران، ممکن است در برخی رشته مسابقات هیچ تیمی حائز رتبه نشود و یا به عنوان مثال تنها یک رتبه دومی اعلام شود." },
]
